Repository: Xiddler/PORTABLE_ENV
Catalog: vim/plugins/wincompose/src/language/unicode/Block.*.resx
Languages: pl

# U0000_U007F
source: Basic Latin
pl: Alfabet łaciński podstawowy

# U0080_U00FF
source: Latin-1 Supplement
pl: Alfabet łaciński 1 - suplement

# U0100_U017F
source: Latin Extended-A
pl: Alfabet łaciński rozszerzony A

# U0180_U024F
source: Latin Extended-B
pl: Alfabet łaciński rozszerzony B

# U0250_U02AF
source: IPA Extensions
pl: Rozszerzenia IPA

# U02B0_U02FF
source: Spacing Modifier Letters
pl: Oddzielone litery modyfikujące

# U0300_U036F
source: Combining Diacritical Marks
pl: Dostawne znaki diakrytyczne

# U0370_U03FF
source: Greek and Coptic
pl: Alfabet grecki i koptyjski

# U0400_U04FF
source: Cyrillic
pl: Cyrylica

# U0500_U052F
source: Cyrillic Supplement
pl: Uzupełnienie cyrylicy

# U0530_U058F
source: Armenian
pl: Alfabet ormiański

# U0590_U05FF
source: Hebrew
pl: Alfabet hebrajski

# U0600_U06FF
source: Arabic
pl: Alfabet arabski

# U0700_U074F
source: Syriac
pl: Alfabet syryjski

# U0780_U07BF
source: Thaana
pl: Pismo taana

# U0900_U097F
source: Devanagari
pl: Pismo dewanagari

# U0980_U09FF
source: Bengali
pl: Pismo bengalskie

# U0A00_U0A7F
source: Gurmukhi
pl: Pismo gurmukhi

# U0A80_U0AFF
source: Gujarati
pl: Pismo gudżarati

# U0B00_U0B7F
source: Oriya
pl: Pismo orija

# U0B80_U0BFF
source: Tamil
pl: Pismo tamilskie

# U0C00_U0C7F
source: Telugu
pl: Pismo telugu

# U0C80_U0CFF
source: Kannada
pl: Pismo kannada

# U0D00_U0D7F
source: Malayalam
pl: Pismo malajalam

# U0D80_U0DFF
source: Sinhala
pl: Pismo syngaleskie

# U0E00_U0E7F
source: Thai
pl: Pismo tajskie

# U0E80_U0EFF
source: Lao
pl: Pismo laotańskie

# U0F00_U0FFF
source: Tibetan
pl: Pismo tybetańskie

# U1000_U109F
source: Myanmar
pl: Pismo birmańskie

# U10A0_U10FF
source: Georgian
pl: Alfabet gruziński

# U1100_U11FF
source: Hangul Jamo
pl: Jamo hangul

# U1200_U137F
source: Ethiopic
pl: Pismo etiopskie

# U13A0_U13FF
source: Cherokee
pl: Sylabariusz czirokeski

# U1400_U167F
source: Unified Canadian Aboriginal Syllabics
pl: Ujednolicony sylabariusz aborygenów kanadyjskich

# U1680_U169F
source: Ogham
pl: Pismo ogamiczne

# U16A0_U16FF
source: Runic
pl: Runy

# U1700_U171F
source: Tagalog
pl: Język tagalski

# U1720_U173F
source: Hanunoo
pl: Pismo hanuno'o

# U1740_U175F
source: Buhid
pl: Pismo buhid

# U1760_U177F
source: Tagbanwa
pl: Pismo tagbanwa

# U1780_U17FF
source: Khmer
pl: Pismo khmerskie

# U1800_U18AF
source: Mongolian
pl: Pismo mongolskie

# U1900_U194F
source: Limbu
pl: Pismo limbu

# U1950_U197F
source: Tai Le
pl: Pismo dehong dai

# U19E0_U19FF
source: Khmer Symbols
pl: Symbole khmerskie

# U1D00_U1D7F
source: Phonetic Extensions
pl: Rozszerzenia fonetyczne

# U1E00_U1EFF
source: Latin Extended Additional
pl: Alfabet łaciński rozszerzony dodatkowy

# U1F00_U1FFF
source: Greek Extended
pl: Alfabet grecki rozszerzony

# U2000_U206F
source: General Punctuation
pl: Ogólne znaki interpunkcyjne

# U2070_U209F
source: Superscripts and Subscripts
pl: Indeksy górne i dolne

# U20A0_U20CF
source: Currency Symbols
pl: Symbole walut

# U20D0_U20FF
source: Combining Diacritical Marks for Symbols
pl: Dostawne znaki diakrytyczne dla symboli

# U2100_U214F
source: Letterlike Symbols
pl: Symbole literopodobne

# U2150_U218F
source: Number Forms
pl: Formy liczbowe

# U2190_U21FF
source: Arrows
pl: Strzałki

# U2200_U22FF
source: Mathematical Operators
pl: Operatory matematyczne

# U2300_U23FF
source: Miscellaneous Technical
pl: Różne znaki techniczne

# U2400_U243F
source: Control Pictures
pl: Obrazy znaków sterujących

# U2440_U245F
source: Optical Character Recognition
pl: Znaki OCR

# U2460_U24FF
source: Enclosed Alphanumerics
pl: Otoczone znaki alfanumeryczne

# U2500_U257F
source: Box Drawing
pl: Rysunki ramek

# U2580_U259F
source: Block Elements
pl: Elementy blokowe

# U25A0_U25FF
source: Geometric Shapes
pl: Kształty geometryczne

# U2600_U26FF
source: Miscellaneous Symbols
pl: Symbole różne

# U2700_U27BF
source: Dingbats
pl: Ozdoby drukarskie

# U27C0_U27EF
source: Miscellaneous Mathematical Symbols-A
pl: Symbole matematyczne różne A

# U27F0_U27FF
source: Supplemental Arrows-A
pl: Strzałki uzupełniające A

# U2800_U28FF
source: Braille Patterns
pl: Wzory Braille'a

# U2900_U297F
source: Supplemental Arrows-B
pl: Strzałki uzupełniające B

# U2980_U29FF
source: Miscellaneous Mathematical Symbols-B
pl: Symbole matematyczne różne B

# U2A00_U2AFF
source: Supplemental Mathematical Operators
pl: Operatory matematyczne uzupełniające

# U2B00_U2BFF
source: Miscellaneous Symbols and Arrows
pl: Różne symbole i strzałki

# U2E80_U2EFF
source: CJK Radicals Supplement
pl: Klucze uzupełniające CJK

# U2F00_U2FDF
source: Kangxi Radicals
pl: Klucze kangxi

# U2FF0_U2FFF
source: Ideographic Description Characters
pl: Znaki opisu ideograficznego

# U3000_U303F
source: CJK Symbols and Punctuation
pl: Symbole i znaki interpunkcyjne CJK

# U3040_U309F
source: Hiragana
pl: Znaki hiragana

# U30A0_U30FF
source: Katakana
pl: Znaki katakana

# U3100_U312F
source: Bopomofo
pl: Pismo bopomofo

# U3130_U318F
source: Hangul Compatibility Jamo
pl: Jamo zgodności hangul

# U3190_U319F
source: Kanbun
pl: Ideogramy kanbun

# U31A0_U31BF
source: Bopomofo Extended
pl: Pismo bopomofo rozszerzone

# U31F0_U31FF
source: Katakana Phonetic Extensions
pl: Rozszerzenia fonetyczne katakana

# U3200_U32FF
source: Enclosed CJK Letters and Months
pl: Otoczone litery oraz miesiące CJK

# U3300_U33FF
source: CJK Compatibility
pl: Znaki zgodności CJK

# U3400_U4DBF
source: CJK Unified Ideographs Extension A
pl: Ujednolicone ideogramy CJK rozszerzenie A

# U4DC0_U4DFF
source: Yijing Hexagram Symbols
pl: Heksagramy Yijing

# U4E00_U9FFF
source: CJK Unified Ideographs
pl: Ujednolicone ideogramy CJK

# UA000_UA48F
source: Yi Syllables
pl: Sylaby yi

# UA490_UA4CF
source: Yi Radicals
pl: Klucze yi

# UAC00_UD7AF
source: Hangul Syllables
pl: Sylaby hangul

# UD800_UDB7F
source: High Surrogates
pl: Surogaty starsze

# UDB80_UDBFF
source: High Private Use Surrogates
pl: Surogaty starsze prywatnego użytku

# UDC00_UDFFF
source: Low Surrogates
pl: Surogaty młodsze

# UE000_UF8FF
source: Private Use Area
pl: Obszar prywatnego użytku

# UF900_UFAFF
source: CJK Compatibility Ideographs
pl: Ideogramy zgodności CJK

# UFB00_UFB4F
source: Alphabetic Presentation Forms
pl: Alfabetyczne formy prezentacji

# UFB50_UFDFF
source: Arabic Presentation Forms-A
pl: Arabskie formy prezentacji A

# UFE00_UFE0F
source: Variation Selectors
pl: Przełączniki wariantów

# UFE20_UFE2F
source: Combining Half Marks
pl: Dostawne półznaki

# UFE30_UFE4F
source: CJK Compatibility Forms
pl: Formy zgodności CJK

# UFE50_UFE6F
source: Small Form Variants
pl: Małe warianty

# UFE70_UFEFF
source: Arabic Presentation Forms-B
pl: Arabskie formy prezentacji B

# UFF00_UFFEF
source: Halfwidth and Fullwidth Forms
pl: Formy szerokości połówkowej i pełnej

# UFFF0_UFFFF
source: Specials
pl: Znaki specjalne

# U10000_U1007F
source: Linear B Syllabary
pl: Sylabariusz pisma linearnego B

# U10080_U100FF
source: Linear B Ideograms
pl: Ideogramy pisma linearnego B

# U10100_U1013F
source: Aegean Numbers
pl: Liczby egejskie

# U10300_U1032F
source: Old Italic
pl: Alfabet staroitalski

# U10330_U1034F
source: Gothic
pl: Alfabet gocki

# U10380_U1039F
source: Ugaritic
pl: Alfabet ugarycki

# U10400_U1044F
source: Deseret
pl: Alfabet deseret

# U10450_U1047F
source: Shavian
pl: Alfabet Shawa

# U10480_U104AF
source: Osmanya
pl: Alfabet osmanija

# U10800_U1083F
source: Cypriot Syllabary
pl: Sylabariusz cypryjski

# U1D000_U1D0FF
source: Byzantine Musical Symbols
pl: Bizantyjskie symbole muzyczne

# U1D100_U1D1FF
source: Musical Symbols
pl: Symbole muzyczne

# U1D300_U1D35F
source: Tai Xuan Jing Symbols
pl: Symbole Tai Xuan Jing

# U1D400_U1D7FF
source: Mathematical Alphanumeric Symbols
pl: Matematyczne symbole alfanumeryczne

# U20000_U2A6DF
source: CJK Unified Ideographs Extension B
pl: Ujednolicone ideogramy CJK rozszerzenie B

# U2F800_U2FA1F
source: CJK Compatibility Ideographs Supplement
pl: Ideogramy zgodności CJK uzupełniające

# UE0000_UE007F
source: Tags
pl: Znaczniki

# UE0100_UE01EF
source: Variation Selectors Supplement
pl: Przełączniki wariantów uzupełniające

# UF0000_UFFFFF
source: Supplementary Private Use Area-A
pl: Uzupełniający obszar prywatnego użytku A

# U100000_U10FFFF
source: Supplementary Private Use Area-B
pl: Uzupełniający obszar prywatnego użytku B
