Repository: Xiddler/PORTABLE_ENV
Catalog: vim/plugins/wincompose/src/language/i18n/Text.*.resx
Languages: be, id, ro

# AutodetectLanguage
source: Autodetect
be: Аўтавызначэньне
id: Deteksi otomatis
ro: Autodetecţie

# KeyLMenu
source: Left Alt
be: Левы Alt
id: Alt bagian kiri
ro: Alt stânga

# KeyRMenu
source: Right Alt
be: Правы Alt
id: Alt bagian kanan
ro: Alt dreapta

# KeyLControl
source: Left Control
be: Левы Control
id: Control bagian kiri
ro: Control stânga

# KeyRControl
source: Right Control
be: Правы Control
id: Control bagian kanan
ro: Control dreapta

# KeyLWin
source: Left Windows
be: Левы Windows
id: Windows bagian kiri
ro: Windows stânga

# KeyRWin
source: Right Windows
be: Правы Windows
id: Windows bagian kanan
ro: Windows dreapta

# KeyPause
source: Pause
id: Jeda

# KeyConvert
source: Conversion
be: Канвертаваць
id: Konversi
ro: Convertire

# KeyNonConvert
source: Non-conversion
be: Не канвертаваць
id: Non-konversi
ro: Neconvertire

# KeySpace
source: Space
be: Прагал
id: Ruang

# KeyReturn
source: Return
id: Kembali

source: Composing
id: Menulis
ro: Compositie

# UseXorgRules
source: Use sequences from the Xorg project
id: Gunakan urutan dari proyek Xorg
ro: Folosește secvențe din proiectul Xorg

# UseXorgRulesToolTip
source: Use the 3,000 compose sequences from the Xorg project (http://www.x.org/). These are the sequences most commonly found on a standard Linux system.
id: Gunakan 3.000 urutan compose dari proyek Xorg (http://www.x.org/). Ini adalah urutan yang paling sering ditemukan pada sistem Linux standar.
ro: Folosește cele 3.000 de secvențe din proiectul Xorg (http://www.x.org/). Aceste secvențe sunt cele mai comune pe un sistem standard Linux.

# UseXComposeRules
source: Use sequences from the XCompose project
id: Gunakan urutan dari proyek XCompose
ro: Folosește sectențe din proiectul XCompose

# UseXComposeRulesToolTip
source: Use the 1,000 compose sequences from the XCompose opensource project (https://github.com/kragen/xcompose). These sequences may sometimes conflict with the Xorg ones.
id: Gunakan 1.000 urutan penulisan dari proyek sumber terbuka XCompose (https://github.com/kragen/xcompose). Urutan ini terkadang konflik dengan Xorg.
ro: Folosește cele 1.000 de secvențe de compozitie din proiectul opensource XCompose (https://github.com/kragen/xcompose). Aceste secvențe pot uneori avea conflicte cu cele din Xorg.

# UseEmojiRules
source: Use WinCompose emoji sequences
id: Gunakan urutan emoji WinCompose
ro: Folosește secventele emoji WinCompose

source: Debug Window
be: Акно адладкі
id: Jendela Debug
ro: Fereastră Depanare

source: Show Sequences…
be: Паказаць пасьлядоўнасьці…
id: Tampilkan Urutan…
ro: Arată secvenţe…

source: Disable
be: Вымкнуць
id: Non-aktifkan
ro: Dezactivează

source: Donation Page
id: Halaman Donasi
ro: Pagina de donații

source: Visit Website
be: Наведаць вэбсайт
id: Mengunjungi situs web
ro: Vizitează site

source: Exit
be: Выйсці
id: Keluar
ro: Ieşire

source: Unicode characters
be: Сымбалі Юнікоду
id: Karakter unicode
ro: Caractere Unicode

source: Sequences
be: Пасьлядоўнасьці
id: Urutan
ro: Secvenţe

# SwapOnInvalid
source: Try to swap the two keys
id: Cobalah untuk menukar dua tombol
ro: Încearcă să schimbi locul celor două taste

# SwapOnInvalidToolTip
source: Try to swap the keys of a two-key sequence. For instance, if Compose E A is not a valid sequence, try Compose A E instead.
id: Cobalah untuk menukar tombolzadari urutan dua tombol. Misalnya, jika Compose E A bukan urutan yang valid, coba Buat E sebagai gantinya.
ro: Încearcă să schimbe locul tastelor dintr-o secvență de două taste. Spre exemplu, dacă Compose E A nu e o secvență corectă, incearcă A E în schimb.

# Search
source: Search Filter:
be: Фільтар пошуку:
id: Filter Pencarian:
ro: Filtru căutare:

source: Compose Key:
be: Кампанавальная клавіша:
id: Tombol Tulisan:
ro: Cheie Compose:

# ComposeKeyToolTip
source: Select the key that should act as the Compose key.
be: Выбяры клавішу, якая стане Кампанавальнай.
id: Pilih tombol yang akan berfungsi sebagai tombol Tulis.
ro: Selectați tasta corespunzătoare pentru Compose.

source: Reset timeout
id: Reset waktu habis
ro: Timpul de resetare

# UnicodeInput
source: Advanced Unicode input
be: Прасунуты ўвод Унікоду
id: Masukan Unicode lanjutan
ro: Intrare Unicode Avansată

# Language
source: Interface language:
be: Мова інтарфэйсу:
id: Bahasa tampilan:

# LanguageToolTip
source: Select the language that WinCompose uses for the interface. By default the operating system language is used.
be: Выбяры мову інтарфэйсу WinCompose. Агадана выкарыстоўваецца мова аперацыйнай сыстэмы.
id: Pilih bahasa antarmuka WinCompose. Secara default bahasa sistem operasi akan digunakan.

source: Close
be: Зачыніць
id: Tutup

source: Copy to clipboard
id: Salin ke papanklip

source: Apply
be: Ужыць
id: Terapkan

# InsertZwspToolTip
source: Microsoft Office applications sometimes change the document font on the fly when entering certain Unicode characters. This feature inserts an invisible character after the Unicode character to work around the bug.
be: Дадаткі Microsoft Office часам мяняюць шрыфт дакумента на ляту пад час уводу некаторых унікодавых сымбаляў. Гэтая опцыя ўстаўляе нябачны сымбаль пасьля ўнікодавага, кабы справіцца з гэнай прыкрасьцю.
id: Aplikasi Microsoft Office terkadang mengubah font dokumen saat memasukkan karakter Unicode tertentu. Fitur ini menyisipkan karakter yang tidak terlihat setelah karakter Unicode untuk mengatasi bug.

# EmulateCapsLock
source: Emulate Caps Lock using both Shift keys
be: Эмуляваць Caps Lock выкарыстоўваючы абедзве клавішы Shift
id: Emulasi Caps Lock menggunakan kedua tombol Shift

# ShiftDisablesCapsLock
source: Shift key disables Caps Lock
be: Клавіша Shift выключае Caps Lock
id: Tombol Shift menonaktifkan Caps Lock

# CapsLockCapitalizes
source: Caps Lock always capitalizes letters
be: Caps Lock заўсёды робіць вялікімі літары
id: Caps Lock selalu mengkapitalisasi huruf

# CapsLockCapitalizesToolTip
source: When Caps Lock is on, typing an accented letter such as “é” will always output the corresponding capitalized letter, in this case “É”.
be: Калі Caps Lock увамкнёна, набіраньне дыякрытызаванай літары, такой як «ź», заўсёды вывядзе адпаведную вялікую літару, ў гэтым выпадку «Ź».
id: Saat Caps Lock aktif, mengetik huruf beraksen seperti "é" akan selalu menghasilkan huruf kapital yang sesuai, dalam hal ini "É".

source: Categories
be: Катэгорыі
id: Kategori

# Options
source: Options — WinCompose
be: Опцыї — WinCompose
id: Opsi — WinCompose

# ShowOptions
source: Options…
be: Опцыї…
id: Opsi…

# TrayToolTip
source: WinCompose v{2} on {0} ({1} sequences)
be: WinCompose v{2} на {0} ({1} пасьлядоўнасьцяў)
id: WinCompose v{2} pada {0} ({1} urutan)

source: General
be: Асноўныя
id: Umum

source: Behavior
be: Паводзіны
id: Perilaku

# WindowTitle
source: Sequences — WinCompose
be: Паслядоўнасці — WinCompose
id: Urutan — WinCompose

# UserMacros
source: User-defined macros
be: Макрасы карыстальніка
id: Makro yang ditentukan pengguna

# DisabledToolTip
source: WinCompose is disabled
be: WinCompose адключаны
id: WinCompose dinonaktifkan

# KeyInsert
source: Insert
id: Masukkan

source: Test Typing
be: Праверце набор
id: Tes Pengetikan

source: Tweaks
be: Паляпшэнні
id: Penyesuaian

# DelaySeconds
source: {0} seconds
id: {0} detik

source: About
be: Пра праґраму
id: Tentang

# Download
source: Download WinCompose {0}
be: Спампаваці WinCompose {0}
id: Unduh WinCompose {0}

# AboutBoxTitle
source: About WinCompose
be: Пра WinCompose
id: Tentang WinCompose

source: Programming
be: Праграмаванне
id: Pemrograman

# Translators
source: Translation
be: Пераклад
id: Terjemahan

source: Authors
id: Pembuat

source: License
be: Ліцэнзія
id: Lisensi

# NeedRestart
source: WinCompose needs to be restarted for some changes to take effect.
be: WinCompose неабходна перазапусціць, каб некаторыя змены ўступілі ў сілу.
id: WinCompose perlu direstart agar beberapa perubahan diterapkan.

# ReportBug
source: Report a Bug
be: Паведаміць пра памылку
id: Laporkan Bug

source: Help
be: Дапамога
id: Bantuan

# UpdatesToolTip
source: Updates are available.
be: Абнаўленьні наяўныя.
id: Pembaruan tersedia.

source: User-defined sequences
be: Паслядоўнасці карыстальніка
id: Urutan yang ditentukan pengguna

# UserDefinedSequencesEdit
source: Edit
be: Правіць
id: Sunting

# UserDefinedSequencesReload
source: Reload
be: Перачытаць
id: Muat ulang

# KeyDisabled
source: Disabled
be: Вымкнутая
id: Nonaktifkan

# CheckUpdates
source: Automatically check for updates
id: Otomatis memeriksa pembaruan

# ChangeComposeKey
source: Change…
id: Ubah…

source: Add to favorites
id: Tambah ke favorit

# DisableIcon
source: Disable notification area icon
id: Nonaktifkan ikon area pemberitahuan

source: No timeout
id: Tidak ada waktu habis

source: Advanced
id: Lanjut

source: Special Thanks
be: Падзякі
id: Terima kasih kepada

source: Remove from favorites
id: Hapus dari favorit

source: Favorites
id: Favorit

# TimeoutToolTip
source: If set, any compose sequence will be cancelled after a certain delay if no keyboard activity is detected.
id: Jika disetel, urutan compose apa pun akan dibatalkan setelah penundaan tertentu jika tidak ada aktivitas keyboard yang terdeteksi.

source: Keyboard LED
id: LED Keyboard

# KeyboardLedToolTip
source: If set, the corresponding keyboard LED will be lit when a compose sequence is in progress.
id: Jika disetel, LED keyboard yang sesuai akan menyala saat urutan compose sedang berlangsung.

# KeyCompose
source: Compose
id: Menyusun

# AutoLaunch
source: Launch WinCompose on login
id: Luncurkan WinCompose saat masuk

# KeyApps
source: Menu
be: Меню

source: Restart
be: Перазапуск
ro: Restartează

# InvalidSequences
source: On invalid sequences
be: Пры няправільных пасьлядоўнасьцях
ro: Pentru secvențe nevalide

# CaseInsensitive
source: Fall back to case insensitive matches
be: Адступаць да раґістранечутлівых супадзеньняў

# CaseInsensitiveToolTip
source: If the entered sequence does not exist, but there is one that only differs by case, automatically correct it.
be: Калі ўведзеная пасьлядоўнасьць не існуе, але ёсьць та, што адрозьніваецца толькі рэґістрам, то аўтаматычна выпраўляць яе.

# DiscardOnInvalid
source: Discard all typed characters
be: Скасаваць усе набраныя сымбалі

# DiscardOnInvalidToolTip
source: If the entered sequence does not exist, discard all the characters that were typed. The default behaviour is to output the characters as if the compose key had not been used.
be: Калі ўведзеная пасьлядоўнасьць не існуе, то скасаваць усе набраныя сымбалі. Агадана яны выводзяцца так, бы кампанавальная клавіша не націскалась.

# BeepOnInvalid
source: Emit a beep
be: Выдаваць гудок

# BeepOnInvalidToolTip
source: If the entered sequence does not exist, emit a system sound.
be: Калі ўведзеная пасьлядоўнасьць не існуе, то выдаць сыстэмны гук.

source: Emoji
be: Эмоджы

# KeepOriginalKey
source: Maintain original compose key behaviour
be: Захаваць зыходныя паводзіны клавішы

# KeepOriginalKeyToolTip
source: This tells WinCompose to make a best effort to retain the original key’s behaviour. For instance, the Alt-Tab shortcut will still work even if Alt is used as the compose key.
be: Гэта наказвае WinCompose мкнуцца захаваць першасныя паводзіны клавішаў. Напрыклад, спалука Alt+Tab працавацьме па-ранейшаму нават, калі Alt выкарыстана як кампанавальная клавіша.

# InsertZwsp
source: Insert zero-width spaces in Office apps
be: Устаўляць прагалы нулявой шырыні ў офісных праграмах

# EmulateCapsLockToolTip
source: If Caps Lock is used as the compose key, the original behaviour of the key becomes unavailable. This feature allows to turn Caps Lock on by pressing both Shift keys simultaneously.
be: Калі Caps Lock ужываецца як кампанавальная клавіша, першапачатковыя паводзіны клавішы стаюць недаступнымі. Гэтая опцыя дазваляе ўвамкнуць Caps Lock націсканьнем абедзьвюх клавішаў Shift адначасова.

# ShiftDisablesCapsLockToolTip
source: If Caps Lock is used as the compose key, the original behaviour of the key becomes unavailable. This feature allows to turn Caps Lock off by pressing the Shift key.
be: Калі Caps Lock ужываецца як кампанавальная клавіша, першапачатковыя паводзіны клавішы стаюць недаступнымі. Гэтая опцыя дазваляе вымкнуць Caps Lock націсканьнем клавішы Shift.

source: In selected categories
be: У абраных катэгорыях

# AllowInjected
source: Allow Injected Keys
be: Дазволіць управаджаныя клавішы

# AllowInjectedToolTip
source: Do not ignore keys sent by other software like AutoHotkey or Synergy
be: Не іґнараваці клавішы дасланыя іншымі праґрамамі, як AutoHotkey ці Synergy

# KeyPrint
source: Prt Scrn
be: «Print Screen»

# KeyEscape
source: Escape
ro: Esc

# UseEmojiRulesToolTip
source: Use the compose sequences for Emoji provided by the WinCompose author and contributors.
ro: Folosește secvențele de compoziție pentru Emoji prevăzute de catre autorii și contribuitorii WinCompose.

# UnicodeInputToolTip
source: Enable Unicode input for all characters, even those with no compose sequence defined. For instance, the following sequence will output character U+1A3F: Compose U 1 A 3 F Enter
ro: Activați intrarea Unicode pentru toate caracterele, chiar și cele care nu au o secvență de compoziție definită. Spre exemplu, următoarea secvență va produce caracterul U+1A3F: Compose U 1 A 3 F Enter
